Repository: AlbaneMiron/drone-simulation
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fr

source: Night
fr: Nuit

source: Day
fr: Jour

source: All incidents
fr: Toutes les interventions

source: OHCA undeteced
fr: ACR non détecté

source: OHCA Detected
fr: ACR détecté

source: Not enough witnesses
fr: Pas assez de témoins

source: Enough witnesses
fr: Assez de témoins

source: Drone faster
fr: Drone plus rapide

source: BLS team faster
fr: VSAV plus rapide

source: No drone
fr: Pas de drone

source: BLS team
fr: VSAV

source: <b>Drone faster</b> <br> by:
fr: <b>Drone plus rapide</b> <br> de :

source: <b>BLS team faster</b> <br> by:
fr: <b>VSAV plus rapide</b> <br> de :

source: <b>No drone</b> <br> BLS team time to arrival:
fr: <b>Pas de drone</b> <br> temps de présentation du VSAV :

source: Not detected
fr: ACR non détecté

source: Detected but by night
fr: Détecté mais la nuit

source: Detected but not enough witnesses
fr: Détecté mais pas assez de témoins

source: BLS team faster than drone
fr: VSAV plus rapide que le drone

source: Time to arrival when a drone is sent (in seconds)
fr: Temps de présentation quand un drone est envoyé (en s)

source: Number of incidents
fr: Nombre d’interventions

source: Time difference drone - BLS team (in seconds)
fr: Différence de temps entre le drone et le VSAV

source: About
fr: Présentation

source: App presentation
fr: Présentation de l’application

source: This website simulates drones sent with Automatic External Defibrillators to Out-of-Hospital Cardiac Arrest incidents. Simulation is based on real life data, gathered in 2017 by Paris' Firefighters, who intervened on more than 3000 OHCA in Paris and Paris suburbs.
fr: Ce site internet simule l’envoi de drones porteurs de défibrillateurs automatiques externes pour les patients en Arrêt Cardio-Respiratoire extrahospitaliers. La simulation est basée sur les données réelles des interventions effectuées par la Brigade de Sapeurs Pompiers de Paris en 2017, qui sont intervenus sur plus de 3000 ACR à Paris et dans les départements limitrophes (Seine Saint Denis, Hauts de Seine et Val de Marne).

source: The aim is to compare the hypothetical time to arrival of drones to the actual time to arrival of BLS teams, and to estimate to what extent drones could improve the chain of survival.
fr: La simulation permet de comparer le temps de présentation hypothétique mis par un drone avec le temps réel de présentation du Véhicule de Secours et d’Assistance aux Victimes. Cela permet d’estimer quel pourrait être l’impact des drones sur l’amélioration de la chaîne de survie.

source: This app allows the user to compute their own simulation, by changing both dispatch center and drone flight parameters. The source code is available on
fr: Ce site permet à l’utilisateur de faire tourner sa propre simulation en choisissant les paramètres relatifs aux caractéristiques de la régulation de l’appel aux secours et aux caractéristiques du drone. Le code source est disponible sur

source: to allow for expertise and replication.
fr: pour pouvoir être expertisé et répliqué.

source: Default parameters correspond to what is assumed to be the most likely set of drone characteristics and to the actual operationalperformance of Paris'firefighters medical dispatch center.
fr: Par défaut les paramètres des simulations sont ceux qui nous paraissent les plus probables (pour les caractéristiques des drones) ou ceux des performances actuelles de la régulation médicales des sapeurs-pompiers de Paris.

source: Simulation description
fr: Description de la simulation

source: Rescue chain: BLS teams vs drones
fr: Chaine de secours : VSAV versus drone

source: Parameters simulation A
fr: Paramètres simulation A

source: Parameters simulation B
fr: Paramètres simulation B

source: Comparison of both simulations
fr: Comparaison des simulations

source: Custom Datasets
fr: Données personnalisées

source: Launch a simulation on your own data:
fr: Lancez une simulation avec vos propres données :

source: Starting Points
fr: Positions de départ

source: Upload a CSV file containing a list of starting points for drones. Each row represents one starting point and should contain an index followed by the latitude and longitude of the point. Example:
fr: Déposez un fichier CSV contenant la liste des positions de départ des drones. Chaque ligne doit représenter une position de départ et contenir un index suivi de la latitude et longitude de la position. Exemple :

source: Drag and Drop or
fr: Faites glisser et déposez ou

source: Select a File
fr: Choisir un Fichier

source: Incidents
fr: Interventions

source: Upload a CSV file containing a list of incidents. Each row represents one incident and should contain the following fields:
fr: Déposez un fichier contenant la liste des interventions. Chaque ligne doit représenter une intervention et contenir les colonnes suivantes :

source: time_call: the date and time of the emergency call
fr: time_call : la date et l’heure de l’appel des secours

source: latitude: the latitude of the incident, as a float
fr: latitude : la latitude de l’intervention (type : float)

source: longitude: the longitude of the incident as a float
fr: longitude : la longitude de l’intervention (type : float)

source: BLS_time: the time taken by the BLS team to reach the incident, in seconds
fr: BLS_time : durée mise par le VSAV pour se présenter sur les lieux de l’intervention, en secondes (type : float)

source: home: a flag indicating whether the incident happened at home (1) or in a street or public place (0)
fr: home : une indicatrice égale à 1 si l’intervention est à domicile, 0 si elle est dans un lieu ou une voix publique

source: You can get additional info on parameters descriptions by hovering your mouse over each of them.
fr: Des informations supplémentaires sur les paramètres s’affichent en passant votre curseur dessus.

source: Drone parameters
fr: Paramètres du drone

source: Initial drone location
fr: Position initiale du drone

source: Where drones are stationed. The simulator selects the closest available drone (as the crow flies)
fr: Position des drones avant envoi. Le simulateur sélectionne le drone disponible le plus proche à vol d’oiseau

source: Maximum horizontal speed
fr: Vitesse horizontale maximale

source: Drone's acceleration time (in sec):
fr: Durée d'accélération du drone (en s) :

source: Time needed for the drone to reach its maximum horizontal speed.
fr: Temps nécessaire au drone pour atteindre sa vitesse horizontale maximale.

source: Drone's vertical speed (in m/s):
fr: Vitesse verticale du drone (en m/s) :

source: Maximum vertical speed. It is assumed that the time needed for the drone to reach this speed is negligible.
fr: Vitesse verticale maximale. On considère que le temps mis par le drone pour atteindre cette vitesse est négligeable.

source: Drone's cruise altitude (in m):
fr: Altitude de croisière du drone (en m) :

source: Horizontal cruise altitude
fr: Altitude de croisière

source: Unavailability of the drone after a run (in h):
fr: Indisponibilité du drone après un lancer (en h) :

source: Time needed after a run for the drone to be available again. It accounts for the time spent on the OHCA location and the time of refurbishment and rehabilitation of equipment.
fr: Délai nécessaire après l’envoi du drone avant qu’il ne redevienne disponible. Cela comprend le temps passé sur les lieux de l’intervention.

source: Drone can fly during aeronautical night
fr: Les drones peuvent voler durant la nuit aéronautique

source: Whether the drone can only fly during the aeronautical day or not
fr: Le drone a t’il l’autorisation de voler durant la nuit aéronautique ?

source: Yes
fr: Oui

source: No
fr: Non

source: Operational parameters
fr: Paramètres opérationnels

source: Delay at departure (in s):
fr: Retard au départ (en s) :

source: Delay at departure needed for the operator to set up flight information for the drone then for the fire station where the drone is stationed to launch it.
fr: Durée nécessaire à l'opérateur pour entrer les informations de vol pour le drone et à la caserne du drone sélectionné de le faire décoller.

source: Delay on arrival (in s):
fr: Retard à l'arrivée (en s) :

source: Delay on arrival needed for the drone to narrow its landing and for the bystander to catch the AED.
fr: Durée à l'arrivée durant laquelle le drone précise sa position d'arrivée et le témoin récupère le DSA.

source: Delay between detection of unconsciousness and OHCA detection (in s):
fr: Décalage de détection inconscience/ACR (en s) :

source: Mean time spent between unconsciousness and OHCA detection by emergency call dispatchers. Unconsciousness detection activates BLS teams whereas drones are activated only at OHCA detection.
fr: Durée moyenne entre la détection d'inconscience et la détection d'un ACR par l'opérateur 18/112. Les VSAV sont déclenchés au diagnostic d'inconscience, les drones sont activés quand l'ACR est détecté.

source: Rate of OHCA at home, which are detected by call center operators:
fr: Taux d’ACR à domicile détectés par l’opérateur :

source: When the OHCA is not detected by the emergency dispatchers no drone is sent. (Value between 0 and 1)
fr: Taux d’ACR en lieu public détectés par l’opérateur : les drones ne sont pas activés si l’ACR n’est pas détecté au téléphone. (Valeur entre 0 et 1).

source: Rate of OHCA in the streets, which are detected by call center operators:
fr: Taux d’ACR en lieu public détectés par l’opérateur :

source: Rate of OHCA at home, which only have one witness alone:
fr: Taux de témoins seuls ACR lieu privé :

source: The simulation requires at least two witnesses for OHCA at home : one to stay near the victim, the other to go out in the street to get the AED brought by drone. (Value between 0 and 1)
fr: La simulation demande au moins deux témoins pour les ACR à domicile : le premier pour rester auprès de la victime, et le second pour descendre dans la rue chercher le DSA apporté par drone. (Valeur entre 0 et 1).

source: Update simulation
fr: Lancer la simulation

source: Results
fr: Résultats

source: Flight exclusions
fr: Restrictions de vol

source: Intervention distribution
fr: Distribution des interventions

source: Time to arrival histogram when a drone is sent
fr: Histogramme des temps de présentation quand un drone est envoyé

source: Comparison of times to arrival for all incidents
fr: Comparaison des temps de présentation pour toutes les interventions

source: Hover over the graph to get more info
fr: Parcourez le graphe pour avoir plus d’informations.

source: Flight exlcusions
fr: Restrictions de vol

source: Airborne AED simulation
fr: Simulation DAE porté par drone

source: Fork me on GitHub
fr: Dupliquer sur GitHub
